In [56]:
import numpy as np
import pandas as pd

In [2]:
# Membuat dataFrame dgn random data,terdiri dr 5 baris dan 4 kolom
# Dengan indexnya adalah A B C Dyang di split
# Spti di JS, split digunakan untuk memotong mjdkan sebuah Array
# Menetapkan Kolomnya adalah W, X, Y, Z yg di split
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567
B  1.079978 -1.634423 -1.727656 -0.074905
C -0.776402 -0.412992 -0.217633 -2.875143
D -1.357142 -1.483163  0.454048  0.511561
E  0.335134 -0.136648  0.202444 -0.934805

In [3]:
# Menampilkan data pd kolom, 
# 1. df['W']
# 2. df.W
df['W']

A    0.941346
B    1.079978
C   -0.776402
D   -1.357142
E    0.335134
Name: W, dtype: float64

In [4]:
# Menampilkan dua kolom sekaligus
# df[['W', 'Z', dst.]]
df[['W', 'Z', 'Y']]

          W         Z         Y
A  0.941346  0.143567 -1.992532
B  1.079978 -0.074905 -1.727656
C -0.776402 -2.875143 -0.217633
D -1.357142  0.511561  0.454048
E  0.335134 -0.934805  0.202444

In [5]:
# Menampilkan kolom baru, yg datanya diambil dr W ditambah kolom Y dll
df['Baru'] = df['W'] + df['Y']
df

          W         X         Y         Z      Baru
A  0.941346 -1.382468 -1.992532  0.143567 -1.051187
B  1.079978 -1.634423 -1.727656 -0.074905 -0.647678
C -0.776402 -0.412992 -0.217633 -2.875143 -0.994035
D -1.357142 -1.483163  0.454048  0.511561 -0.903094
E  0.335134 -0.136648  0.202444 -0.934805  0.537578

In [10]:
df['Baru']

A    1.087452
B    0.928453
C    1.170179
D   -0.371291
E   -0.069290
Name: Baru, dtype: float64

In [6]:
# MENGHAPUS KOLOM
df.drop('Baru', axis=1)
# jika axis=0 -> menampilkan Index
# jika axis=1 -> menampilkan Kolom
# Ini tidak benar2 menghapus data kolomnya. bisa di lihat. T

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567
B  1.079978 -1.634423 -1.727656 -0.074905
C -0.776402 -0.412992 -0.217633 -2.875143
D -1.357142 -1.483163  0.454048  0.511561
E  0.335134 -0.136648  0.202444 -0.934805

In [12]:
# Memakai cara diatas bisa menghapus, namun jika dipanggil kembali
df

          W         X         Y         Z      Baru
A  0.800581 -1.414501  0.286871  0.899444  1.087452
B  0.507926  0.148302  0.420527  0.756216  0.928453
C  1.323612  0.946463 -0.153433  0.753556  1.170179
D  1.341074 -0.384369 -1.712365  2.235384 -0.371291
E  0.050315  0.374653 -0.119606  1.192155 -0.069290

In [7]:
# Caranya adalah:
# Ketika inplace 'TRUE' makan mengeksekusi secara langsung
# Tetapi tidak bisa menampilkanlangsung Datanya
df.drop('Baru', axis=1, inplace=True)
df

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567
B  1.079978 -1.634423 -1.727656 -0.074905
C -0.776402 -0.412992 -0.217633 -2.875143
D -1.357142 -1.483163  0.454048  0.511561
E  0.335134 -0.136648  0.202444 -0.934805

In [8]:
# MENGHAPUS BARIS
# dengan axis=0
df.drop('E', axis=0)

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567
B  1.079978 -1.634423 -1.727656 -0.074905
C -0.776402 -0.412992 -0.217633 -2.875143
D -1.357142 -1.483163  0.454048  0.511561

In [9]:
# Sama halnya, ara diatas hanya kelihatannya saja terhapus
# jika di cetak kembali datanya masih ada
df

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567
B  1.079978 -1.634423 -1.727656 -0.074905
C -0.776402 -0.412992 -0.217633 -2.875143
D -1.357142 -1.483163  0.454048  0.511561
E  0.335134 -0.136648  0.202444 -0.934805

In [12]:
# Menampilkan data index labels 'A'
df.loc['A']

W    0.941346
X   -1.382468
Y   -1.992532
Z    0.143567
Name: A, dtype: float64

In [13]:
# Menampilkan data by index
df.iloc[3]

W   -1.357142
X   -1.483163
Y    0.454048
Z    0.511561
Name: D, dtype: float64

In [14]:
# Mendapatkan data lebih terperini
df.loc['C', 'X'] # Ini akan mempilkan baris C, kolom X

-0.412992251803268

In [15]:
# Menampilkan data dari Baris A & B. Kolom X & Y
df.loc[['A', 'B'], ['X', 'Y']]

          X         Y
A -1.382468 -1.992532
B -1.634423 -1.727656

In [16]:
# SELEKSI KONDISI
# Seleksi data yang lebih dr 0
df > 0 # Menghasilkan nilai boolean(True/False)

       W      X      Y      Z
A   True  False  False   True
B   True  False  False  False
C  False  False  False  False
D  False  False   True   True
E   True  False   True  False

In [17]:
df[df > 0]

          W   X         Y         Z
A  0.941346 NaN       NaN  0.143567
B  1.079978 NaN       NaN       NaN
C       NaN NaN       NaN       NaN
D       NaN NaN  0.454048  0.511561
E  0.335134 NaN  0.202444       NaN

In [18]:
# Menampilkan data berdasarkan kolom 'W'yang lebih > 0
df[df['W'] > 0]

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567
B  1.079978 -1.634423 -1.727656 -0.074905
E  0.335134 -0.136648  0.202444 -0.934805

In [20]:
# Menampilkan data kolom 'Y' berdaszrkan kolom 'W' yg lebih dari 0
df[df['W']>0] ['Y']

A   -1.992532
B   -1.727656
E    0.202444
Name: Y, dtype: float64

In [22]:
# Menampilkan data kolom 'X, Y, Z' berdaszrkan kolom 'W' yg lebih dari 0
df[df['W']>0][['X','Y','Z']]

          X         Y         Z
A -1.382468 -1.992532  0.143567
B -1.634423 -1.727656 -0.074905
E -0.136648  0.202444 -0.934805

In [27]:
# Menampilkan data kolom berdasarkan kolom 'W' > 0 dan 'Z' > 0
df[(df['W']>0) & (df['Z']>0)]

          W         X         Y         Z
A  0.941346 -1.382468 -1.992532  0.143567

In [29]:
# Menampilkan data kolom 'W' > 1 atau 'Y'> 0
df[(df['W']>1) | (df['Y']>0)]

          W         X         Y         Z
B  1.079978 -1.634423 -1.727656 -0.074905
D -1.357142 -1.483163  0.454048  0.511561
E  0.335134 -0.136648  0.202444 -0.934805

In [30]:
# DETAIL INDEXING
# Mereset Index Label menjadiindex default
df.reset_index()

  index         W         X         Y         Z
0     A  0.941346 -1.382468 -1.992532  0.143567
1     B  1.079978 -1.634423 -1.727656 -0.074905
2     C -0.776402 -0.412992 -0.217633 -2.875143
3     D -1.357142 -1.483163  0.454048  0.511561
4     E  0.335134 -0.136648  0.202444 -0.934805

In [40]:
# Membuat Kolom Baru
df['code'] = 'IDN JPN USA RSA MLY'.split()
df

             W         X         Y         Z code
code
IDN   0.941346 -1.382468 -1.992532  0.143567  IDN
JPN   1.079978 -1.634423 -1.727656 -0.074905  JPN
USA  -0.776402 -0.412992 -0.217633 -2.875143  USA
RSA  -1.357142 -1.483163  0.454048  0.511561  RSA
MLY   0.335134 -0.136648  0.202444 -0.934805  MLY

In [41]:
df.set_index('code')
# Sama halnya dengan 'DROP', jk data ditampilkan tidak ada yg berubah
# data awal akan berudah dengan menggunakan 'inplace=True'

             W         X         Y         Z
code
IDN   0.941346 -1.382468 -1.992532  0.143567
JPN   1.079978 -1.634423 -1.727656 -0.074905
USA  -0.776402 -0.412992 -0.217633 -2.875143
RSA  -1.357142 -1.483163  0.454048  0.511561
MLY   0.335134 -0.136648  0.202444 -0.934805

In [42]:
# Set index secara permanently menggunakan inplace=True
df.set_index('code', inplace=True)

In [43]:
df

             W         X         Y         Z
code
IDN   0.941346 -1.382468 -1.992532  0.143567
JPN   1.079978 -1.634423 -1.727656 -0.074905
USA  -0.776402 -0.412992 -0.217633 -2.875143
RSA  -1.357142 -1.483163  0.454048  0.511561
MLY   0.335134 -0.136648  0.202444 -0.934805

In [44]:
# MULTI INDEXING
dataLabels = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels, dataValue))
# 'ZIP' : menggbungkan 2 array / lebih menjadi beberapa tuple
# 'LIST' : membuat list dari tuple - tuple yang ada
# 'MULTI-INDEX' : membuat beberapa pengindex-an baru dari sebuah tuple
data = pd.MultiIndex.from_tuples(data)

In [45]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [46]:
df = pd.DataFrame(np.random.randn(6,2), index=data, columns=['A', 'B'])
df

             A         B
G1 1  0.266122  1.707412
   2  1.813627 -1.877769
   3 -0.203442 -0.702241
G2 1 -0.638813 -1.449315
   2  1.981711  0.171561
   3  0.675055 -0.307940

In [48]:
# Menampilkan index dari 'G1'
df.loc['G1']

          A         B
1  0.266122  1.707412
2  1.813627 -1.877769
3 -0.203442 -0.702241

In [49]:
# Menampilkan index dari 'G1' sub-index-3
df.loc['G1'].loc[3]

A   -0.203442
B   -0.702241
Name: 3, dtype: float64

In [50]:
# Melihat Nama Index
df.index.names

FrozenList([None, None])

In [52]:
df.index.names = ['Group', 'Num']
df

                  A         B
Group Num
G1    1    0.266122  1.707412
      2    1.813627 -1.877769
      3   -0.203442 -0.702241
G2    1   -0.638813 -1.449315
      2    1.981711  0.171561
      3    0.675055 -0.307940

In [53]:
# '.XS' : untuk menampilkan dataFrame multiIndex
df.xs('G1')

            A         B
Num
1    0.266122  1.707412
2    1.813627 -1.877769
3   -0.203442 -0.702241

In [54]:
# Menampilkan index 'G1' dgn sub-index ke- 2
df.xs(['G1', 2])

A    1.813627
B   -1.877769
Name: (G1, 2), dtype: float64

In [57]:
# Menampilkan sub-index ke-2 dari collumn 'num'
df.xs(2, level='Num')

              A         B
Group
G1     1.813627 -1.877769
G2     1.981711  0.171561